Repository: ukccatc/Metronome
Catalog: lib/l10n/app_*.arb
Languages: ru

# appTitle
source: Metronome
ru: Метроном

source: How to Use
ru: Как использовать

source: Settings
ru: Настройки

source: Play
ru: Играть

source: Pause
ru: Пауза

source: Stop
ru: Стоп

source: BPM
ru: Темп

# bpmDescription
source: Set the tempo. Higher numbers = faster tempo. Use +/- buttons or tap the number to edit.
ru: Установите темп. Большие числа = быстрее темп. Используйте кнопки +/- или нажмите на число для редактирования.

source: Time Signature
ru: Размер

# timeSignatureDescription
source: Set how many beats per measure. 4/4 (Common) is most popular, 3/4 (Waltz) for dancing, 2/4 (March) for marching music.
ru: Установите количество долей в такте. 4/4 (Четыре четверти) самый популярный, 3/4 (Вальс) для танцев, 2/4 (Марш) для маршевой музыки.

source: Beat Subdivision
ru: Дробление долей

# beatSubdivisionDescription
source: Choose how the beats are divided. Quarter (1/4) is standard, Eighth (1/8) plays twice as fast, Triplet (1/3) creates swing feel, Sixteenth (1/16) is very fast.
ru: Выберите, как делятся доли. Четвертные (1/4) стандартные, Восьмые (1/8) играют в два раза быстрее, Триоли (1/3) создают свинговое ощущение, Шестнадцатые (1/16) очень быстрые.

source: Accent Pattern
ru: Акцентный рисунок

# accentPatternDescription
source: Choose which beats are emphasized. Accented beats play louder and help you feel the rhythm structure.
ru: Выберите, какие доли подчеркиваются. Акцентированные доли играют громче и помогают почувствовать структуру ритма.

source: Metronome Controls
ru: Управление метрономом

# metronomeControlsDescription
source: Play/Pause to start or stop the metronome. Stop button resets to beat 1.
ru: Играть/Пауза для запуска или остановки метронома. Кнопка Стоп сбрасывает на долю 1.

source: Volume
ru: Громкость

# volumeDescription
source: Adjust the volume of the metronome. Higher values make the clicks louder.
ru: Настройте громкость метронома. Большие значения делают щелчки громче.

source: Beat Indicator
ru: Индикатор долей

# beatIndicatorDescription
source: Shows which beat you're currently on. The highlighted circle is the current beat.
ru: Показывает, на какой доле вы сейчас находитесь. Выделенный круг - текущая доля.

source: Quarter
ru: Четвертные

source: Eighth
ru: Восьмые

source: Triplet
ru: Триоли

source: Sixteenth
ru: Шестнадцатые

source: Common
ru: Четыре четверти

source: Waltz
ru: Вальс

source: March
ru: Марш

source: Quintuple
ru: Пять четвертей

source: None
ru: Нет

source: First Beat
ru: Первая доля

source: Strong-Weak
ru: Сильная-слабая

source: Custom
ru: Пользовательский

source: Welcome to Metronom!
ru: Добро пожаловать в Метроном!

# welcomeDescription
source: Metronom is a professional metronome app designed for musicians of all levels. This guide will help you get started quickly and make the most of all features.
ru: Метроном - это профессиональное приложение-метроном, разработанное для музыкантов всех уровней. Это руководство поможет вам быстро начать работу и максимально использовать все функции.

# quickStart
source: Quick Start (30 seconds)
ru: Быстрый старт (30 секунд)

# step1
source: Look at the Beat Indicator
ru: Посмотрите на индикатор долей

# step1Description
source: The row of circles at the top shows which beat you're on. The highlighted circle is the current beat.
ru: Ряд кружков вверху показывает, на какой доле вы находитесь. Выделенный круг - текущая доля.

# step2
source: Press the Play Button
ru: Нажмите кнопку Играть

# step2Description
source: Tap the play button (▶️) to start the metronome. You'll hear clicks and see the beat indicator move.
ru: Нажмите кнопку воспроизведения (▶️), чтобы запустить метроном. Вы услышите щелчки и увидите, как движется индикатор долей.

# step3
source: Adjust the Tempo
ru: Настройте темп

# step3Description
source: Use the +/- buttons next to the BPM number to make it faster or slower. BPM means "beats per minute".
ru: Используйте кнопки +/- рядом с числом темпа, чтобы сделать его быстрее или медленнее. Темп означает "ударов в минуту".

# step4
source: Start Practicing!
ru: Начните заниматься!

# step4Description
source: Play along with the metronome. The visual indicator helps you stay in time.
ru: Играйте вместе с метрономом. Визуальный индикатор поможет вам держать ритм.

source: Detailed Instructions
ru: Подробные инструкции

source: All Features Explained
ru: Все функции объяснены

source: Pro Tips
ru: Советы профессионалов

source: Troubleshooting
ru: Решение проблем

source: Start Slow
ru: Начните медленно

# startSlowDescription
source: Begin with a slow tempo (60-80 BPM) and gradually increase speed as you improve.
ru: Начните с медленного темпа (60-80 ударов в минуту) и постепенно увеличивайте скорость по мере улучшения.

source: Use Visual Cues
ru: Используйте визуальные подсказки

# useVisualCuesDescription
source: Watch the beat indicator to help you stay in time, especially when learning new pieces.
ru: Следите за индикатором долей, чтобы помочь себе держать ритм, особенно при изучении новых произведений.

source: Practice Subdivisions
ru: Тренируйте дробления

# practiceSubdivisionsDescription
source: Use eighth or sixteenth notes to practice complex rhythms and improve timing.
ru: Используйте восьмые или шестнадцатые ноты для тренировки сложных ритмов и улучшения чувства времени.

source: Feel the Accents
ru: Чувствуйте акценты

# feelTheAccentsDescription
source: Use accent patterns to understand the musical structure and feel of different time signatures.
ru: Используйте акцентные рисунки, чтобы понять музыкальную структуру и ощущение различных размеров.

source: Adjust Volume
ru: Настройте громкость

# adjustVolumeDescription
source: Set volume so you can hear the metronome clearly without it overpowering your instrument.
ru: Установите громкость так, чтобы вы могли четко слышать метроном, не заглушая свой инструмент.

source: No Sound
ru: Нет звука

# noSoundSolution
source: Check your device volume and the app's volume setting. Make sure your device isn't on silent mode.
ru: Проверьте громкость устройства и настройку громкости приложения. Убедитесь, что устройство не находится в беззвучном режиме.

source: Metronome Won't Start
ru: Метроном не запускается

# metronomeWontStartSolution
source: Try stopping and starting again. Make sure you have a valid BPM setting (40-200).
ru: Попробуйте остановить и запустить снова. Убедитесь, что у вас установлен допустимый темп (40-200).

source: Visual Indicator Not Moving
ru: Визуальный индикатор не движется

# visualIndicatorNotMovingSolution
source: The visual indicator only moves when the metronome is playing. Press the play button to start.
ru: Визуальный индикатор движется только когда метроном играет. Нажмите кнопку воспроизведения для запуска.

source: App Feels Slow
ru: Приложение работает медленно

# appFeelsSlowSolution
source: Close other apps to free up memory. The metronome needs precise timing to work properly.
ru: Закройте другие приложения, чтобы освободить память. Метроному нужно точное время для правильной работы.
